In [69]:
import pandas as pd
import numpy as np
import sqlite3

In [70]:
conn = sqlite3.connect('produkty_zajecia.db')

In [71]:
c = conn.cursor()

In [72]:
c.execute('''
CREATE TABLE IF NOT EXISTS produkty
          ([produkt_id] INTEGER PRIMARY KEY, [nazwa_produktu] TEXT)
''')

In [73]:
c.execute('''
CREATE TABLE IF NOT EXISTS ceny
          ([produkt_id] INTEGER PRIMARY KEY, [cena] integer)
''')

In [74]:
conn.commit()

In [75]:
c.execute('''
INSERT INTO produkty (produkt_id, nazwa_produktu)

VALUES
          (1, 'Komputer'),
          (2, 'Monitor'),
          (3, 'Mysz'),
          (4, 'Klawiatura'),
          (5, 'Drukarka')
''')

conn.commit()

In [76]:
c.execute('''
INSERT INTO ceny (produkt_id, cena)

VALUES
          (1, 1500),
          (2, 2000),
          (3, 50),
          (4, 100),
          (5, 1400)
''')

conn.commit()

In [79]:
c.execute(
    '''
    SELECT a.nazwa_produktu, b.cena FROM produkty a LEFT JOIN ceny b ON a.produkt_id = b.produkt_id
    '''
)

df = pd.DataFrame(c.fetchall(), columns = ['Nazwa produktu', 'Cena'])
df.head()

  Nazwa produktu  Cena
0       Komputer  1500
1        Monitor  2000
2           Mysz    50
3     Klawiatura   100
4       Drukarka  1400

In [80]:
conn = sqlite3.connect('books.db')
c = conn.cursor()

c.execute('''
CREATE TABLE IF NOT EXISTS books
          ([produkt_id] INTEGER PRIMARY KEY, [nazwa_produktu] TEXT)
''')
conn.commit()
c.execute('''
CREATE TABLE IF NOT EXISTS authors
          ([produkt_id] INTEGER PRIMARY KEY, [nazwa_produktu] TEXT)
''')
conn.commit()
c.execute('''
CREATE TABLE IF NOT EXISTS ceny
          ([produkt_id] INTEGER PRIMARY KEY, [cena] integer)
''')
conn.commit()

c.execute('''
INSERT INTO books (produkt_id, nazwa_produktu)

VALUES
          (1, 'Komputer'),
          (2, 'Monitor'),
          (3, 'Mysz'),
          (4, 'Klawiatura'),
          (5, 'Drukarka')
''')

conn.commit()

c.execute('''
INSERT INTO authors (produkt_id, nazwa_produktu)

VALUES
          (1, 'Komputer'),
          (2, 'Monitor'),
          (3, 'Mysz'),
          (4, 'Klawiatura'),
          (5, 'Drukarka')
''')

conn.commit()

c.execute('''
INSERT INTO ceny (produkt_id, cena)

VALUES
          (1, 1500),
          (2, 2000),
          (3, 50),
          (4, 100),
          (5, 1400)
''')

conn.commit()

OperationalError: no such table: produkty